1. Introduction:

This is my first assignment of AI Developer Bootcamp course. The assignment is related to general syntax of Python. Python is a high level language. In ths assignment, I will practice all basic features of python that are base of this course.

2. Data Types

2.1 Variables

In [1]:
counter = 100.00 #floating varaible
miles = 100 # integer variable
name = "Maham" #string variable
#print all the variables
print(counter)
print(miles)
print(name)

100.0
100
Maham

2.2 Numbers

In [2]:
2 #integer

2

In [3]:
2+3 # adding two integers

5

In [4]:
2.3 + 5.5 # adding two floating values

7.8

In [5]:
2**2 #Exponent

4

2.3 String

In [6]:
name = "Maham Daoud"
university = "NUST"
print(name,university)

Maham Daoud NUST

Access values in string

In [7]:
stringvariable = "Hello World"
print("stringvariable[0]:", stringvariable[0])
print("stringvariable[1:5]:", stringvariable[1:5])

stringvariable[0]: H
stringvariable[1:5]: ello

Updating string

In [8]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python"
print("Updated string:", stringVariable)

Updated string: Hello Python

Delete String

In [12]:
stringVariable = "Hello World"
print(stringVariable)
del stringVariable
print(stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

String Special Operators

In [13]:
variable = "Hello"
print(variable + "Python")

HelloPython

In [14]:
variable = "Hello"
print(variable * 3)

HelloHelloHello

In [15]:
variable = "Hello"
print(variable[1])

e

In [16]:
variable = "Hello"
print(variable[1:3])

el

In [17]:
variable = "Hello"
print("H" in variable)

True

In [18]:
variable = "Hello"
print("G" in variable)

False

In [19]:
variable = "Hello"
print("G" not in variable)

True

String formatting Operator

In [20]:
print("My name is %s and age is %d kg!" %("Zara",21))

My name is Zara and age is 21 kg!

2.4 Lists

In [21]:
list1 = ["Mehvish", "1880"]
print(list1)

['Mehvish', '1880']

Accessing values in Lists

In [22]:
list1 = ['physics', 'chemistry', 1997,2000];
list2 = [1, 2, 3, 4, 5, 6, 7];
print("list1[0]: ", list1[0])
print("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

In [23]:
list1 = ['physics', 'chemistry', 1997,2000] # without semi colons
list2 = [1, 2, 3, 4, 5, 6, 7]
print("list1[0]: ", list1[0])
print("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

Updating Lists

In [24]:
list1 = ['physics', 'chemistry', 1997, 2000]
list1[1] = "computer science"
print(list1)

['physics', 'computer science', 1997, 2000]

In [26]:
list1.append("Computer Science")
print(list1)

['physics', 'computer science', 1997, 2000, 'Computer Science']

Delete List Element

In [27]:
list1 = ['physics', 'chemistry', 1997, 2000];
print(list1)
del list1[2];
print("After deleting value at index 2: ")
print(list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2:
['physics', 'chemistry', 2000]

In [28]:
#without semicolons
list1 = ['physics', 'chemistry', 1997, 2000]
print(list1)
del list1[2]
print("After deleting value at index 2: ")
print(list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2:
['physics', 'chemistry', 2000]

In [29]:
list1 = ['physics', 'chemistry', 1997, 2000]
print(list1)
list1.remove("chemistry")
print("After deleting value at index 2 : ")
print(list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

2.5 Dictionaries

Accessing value in Dictionary

In [2]:
dict = {'Name' : "Mehvish", 'Depart' : "BCS", 'Batch' : 2014}
print(dict['Name'])

Mehvish

Updating Dicrionary

In [3]:
dict = {'Name' : "Mehvish", 'Depart' : "BCS", 'Batch' : 2014}
print(dict)
dict['Batch'] = "SP14"
print(dict)
dict["University"] = "COMSATS"
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}

Delete Dictionary Element

In [4]:
dict = { 'Name' : "Mehvish", 'Depart' : "BCS", 'Batch' : 2014}
print(dict)
del(dict['Batch'])
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

In [5]:
dict = { 'Name' : "Mehvish", 'Depart' : "BCS", 'Batch' : 2014}
print(dict)
del dict['Batch']
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

In [6]:
dict = { 'Name' : "Mehvish", 'Depart' : "BCS", 'Batch' : 2014}
print(dict)
dict.clear()
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{}

In [7]:
dict = {'Name' : "Mehvish", 'Depart' : "BCS", 'Batch' : 2014}
print(dict)
del dict

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}

In [8]:
print(dict)

<class 'dict'>

In [9]:
dict = {'Name' : "Mehvish", 'Depart' : "BCS", 'Batch' : 2014}
print(dict)
del dict
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
<class 'dict'>

2.6 Tuples

Accessing values in Tuples

In [11]:
tup = ('Math', '98', 'C programming', '99')
print(tup)

('Math', '98', 'C programming', '99')

In [12]:
print(tup[1])

98

In [13]:
print(tup[1:3])

('98', 'C programming')

Updating Tuples

In [14]:
tup1 = (12, 34.56)
tup1[0] = 10 # no updation because tuples are immutable

TypeError: 'tuple' object does not support item assignment

In [19]:
tup1 = (12, 34.56)
tup2 = ('ab','c')
tup1 = tup1 + tup2
print(tup1)

(12, 34.56, 'ab', 'c')

In [20]:
tup1 = (12, 34.56)
tup2 = ('abc','xyz')
tup3 = tup1 + tup2
print(tup3)

(12, 34.56, 'abc', 'xyz')

Delete Tuple Element

In [21]:
tup = ('physics', 'chemistry', 1997,2000)
print(tup)
del tup
print("After deleting tup: ")
print(tup)

('physics', 'chemistry', 1997, 2000)
After deleting tup:

NameError: name 'tup' is not defined

In [22]:
tup = ('physics', 'chemistry', 1997,2000)
print(tup)

('physics', 'chemistry', 1997, 2000)

In [23]:
del tup
print("After deleting tup: ")
print(tup) # error because the entire tuple is being deleted

After deleting tup:

NameError: name 'tup' is not defined

`2.7 Sets

In [24]:
#list
list1 = [1,2,3,4,5]
print(type(list1))

<class 'list'>

In [25]:
my_set = set(list1)

In [26]:
print(my_set)

{1, 2, 3, 4, 5}

In [27]:
type(my_set)

set

In [28]:
print(type(my_set))

<class 'set'>

In [29]:
my_set = {1,2,3}

In [30]:
print(my_set)

{1, 2, 3}

In [33]:
#set of mixed data types
my_set = {1,"Hello",1.2,'C'}
#adding a single value
my_set.add('D')
print(my_set)

{1, 1.2, 'D', 'Hello', 'C'}

In [34]:
#adding multiple values
my_set.update(list1)
print(my_set)

{1, 1.2, 2, 3, 4, 'D', 5, 'Hello', 'C'}

In [38]:
my_set.discard('G') # 'G' is not present but discard will not raise any error

In [39]:
my_set.remove('G') # 'G' is not present and remove will raise an error

KeyError: 'G'

3. Comparison Operator

In [40]:
1<3

True

In [41]:
15 <= 23

True

In [42]:
'Mehvish' == "Zeenat"

False

In [43]:
"Mehvish" == "Zeenat"

False

In [44]:
"Mehvish" != "Mehvish"

False

In [45]:
(1==1)or(5>2)

True

In [46]:
(1 < 2) and (2 < 1)

False

4. If-Else Statements

In [47]:
if 25 % 2:
    print("Even")
else:
    print("Odd")

Even

In [48]:
if 25 % 2 == 0:
    print("Even")
else:
    print("Odd")

Odd

5. For and While Loop

In [52]:
#example of for Loop
fact = 1
N = 5
for i in range(1, N+1):
    fact = fact * i
    #print(fact)
print(fact)

120

In [53]:
a = 0
while a < 10:
    a = a + 1
    print(a)

1
2
3
4
5
6
7
8
9
10

6. Functions

In [54]:
#Function definition is here
def printme(str):
    #This prints a passed string into this function
    print(str)
    return;
#Now you can call printme function
printme("I'm first call to uset defined function!")

I'm first call to uset defined function!

7. Lambda Functions

In [56]:
#Normal function
def f(x):
    return x**2
print(f(8))

64

In [57]:
#Lambda FUnction
#Lambda expressions
times3 = lambda var: var*3
times3(10)
#lambda expressions: another way to write a function in line

30

In [58]:
#Lambda FUnction
#Lambda expressions
times3 = lambda var: var*3
print(times3(10))
#lambda expressions: another way to write a function in line

30

7.1 Map()

In [68]:
#Map function is used with two arguments; r = map(function, sequence)
#function --> process each value and sequence is any iterale and it can be more than one
#for result we need to convert the value in list or any other container
#map applies the function to all elements of sequence and returns a new list with changed elements(by function).
sentence = 'It is raining cats and dogs'
words = sentence.split() # split function will split the sentence into seperate words list
print(words)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

In [69]:
lenghts = map(lambda word : len(word), words)
#print(lenghts)
#lenghts
list(lenghts)

[2, 2, 7, 4, 3, 4]

7.2 Filter()

In [71]:
#filter built in function that takes two arugments. f = filter(function, sequence or iterable)
#function always return True or False
#sequence can be any iterable
#To see the result we need to convert the result in list or any other container.
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x : x % 2, fib) #odd values
list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [72]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x : x % 2 == 0, fib) # even values
list(result1)

[0, 2, 8, 34]

8. File I/O

Reading Input from Keyboard

In [73]:
string = input("Enter your name: ")
print(string)

Enter your name:  Maham

Maham

In [74]:
from six.moves import input
string = input("Enter your name: ")
print(string)

Enter your name:  Maham Daoud

Maham Daoud

I/O from or to Text File

In [75]:
# r --> file must exist and 'r' will open the file in read mode. If no file exist error will occur
# r+ --> file must exist. opens the file for reading and writing. Does not erase the whole content but if content present will replace the content
#w --> if file does not exist already. It will create a file and will write the data.If file already exists it will delete the old data and will write the new data
#a --> append the existing data. If file not present will create a new one. 
#a+ --> opens a file in append and read mode
fileOpen = open("file.txt", "r+") # error because no such file exists

FileNotFoundError: [Errno 2] No such file or directory: 'file.txt'

In [78]:
fileOpen = open('maham.txt', 'r+')
fileOpen.read()

'Name: Maham Daoud\nDepartment: BCS\n'

In [79]:
fileOpen = open('maham.txt', 'r+')
str = fileOpen.read()
print(str)

Name: Maham Daoud
Department: BCS

In [80]:
fileOpen.close()

In [84]:
fileopen = open('maham.txt', 'r')
str = fileopen.read(5)
print(str)
fileopen.close()

Name:

In [85]:
#Open a file to append
fileopen = open('maham.txt', 'a+')
fileopen.write("Information Technology Lahore")
fileopen.close()

In [86]:
#open a file to read
fileopen = open('maham.txt', 'r+')
str = fileopen.read()
print(str)

Name: Maham Daoud
Department: BCS
Information Technology Lahore

In [87]:
fileopen.close()

File Position

In [88]:
#tell --> current position within the file
#seek --> changes the current file location

In [89]:
#open a file
fileopen = open('maham.txt', 'r+')
str = fileopen.read(10)
print("Read Strings: \n", str)

Read Strings:
 Name: Maha

In [90]:
#check current position
position = fileopen.tell()
print("Current File Positio: \n", position)

Current File Positio:
 10

In [92]:
#reposition the pointer at the start of file
position = fileopen.seek(0,0)
#again file reading
str = fileopen.read(10)
print("Again reading strin: \n", str)

Again reading strin:
 Name: Maha

In [93]:
#closing the file
fileopen.close()

In [94]:
#rename the file maham.txt to mahamdaoud.txt
#without importing os
os.rename("maham.txt","mahamdaoud.txt")

NameError: name 'os' is not defined

In [95]:
import os
os.rename('maham.txt', 'mahamdaoud.txt')

In [96]:
#opening file again
fileopen = open("mahamdaoud.txt", 'r')

In [97]:
str = fileopen.read()
print(str)
fileopen.close()

Name: Maham Daoud
Department: BCS
Information Technology Lahore

In [98]:
os.remove('mahamdaoud.txt')

In [100]:
#again try to open a non existing file
fileopen = open('mahamdaoud.txt' 'r')

FileNotFoundError: [Errno 2] No such file or directory: 'mahamdaoud.txtr'

9. Pandas Inroduction

In [1]:
#pandas is an open source library built on the top of numpy
#used for fast data analysis, cleaning and prepration

10. Series

In [2]:
#similar to numpy arary
#1D labelled array capable to holding any type of data
#indexed by a label, whereas numpt indexed by a number location
#the axis label are collectively called as index
#following sunction is used to create a series:
# s = pd.Series(data, index = index)
# data can be many different things
# --> Python DIctionay, --> ndarray --> scalar value

10.1 From ndarray

In [3]:
# if data is an ndarray, index must be the same length as data
# if no index is passed, one will be created having values [0,1,...len(data)-1]

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#this program will generate 5 ranfom numbers as data and the indexes will be from 'a-e'
s = pd.Series(np.random.randn(5), index = ['a','b','c','d','e'])
s

a   -0.456146
b    0.192635
c   -0.105320
d    0.217863
e    0.345183
dtype: float64

In [7]:
""" Following function will print index and its data type"""
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [8]:
''' if you do not assign any index, automatic index will be assigned to the values'''
s = pd.Series(np.random.randn(5))
s

0   -0.042140
1    0.009500
2    0.599536
3    1.025823
4    0.698095
dtype: float64

In [9]:
'''index type and values'''
s.index

RangeIndex(start=0, stop=5, step=1)

10.2 From Dict

In [13]:
'''In this example, indexes are not given so it will be constructd from sorted key of the dictionary'''
d = {'a': 0.,'b':1.,'c':2.}
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [14]:
d = {'cat': 2 , 'eagle': 4, 'duck' : 5}
pd.Series(d)

cat      2
eagle    4
duck     5
dtype: int64

In [16]:
''' In this example, indexes are given so the values in data corresponding to the indexes will be pulled ot'''
d = {'a':0.,'b':1.,'c':2.,}
pd.Series(d, index = ['b','c','d','a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

10.3 From a Scalar Value

In [18]:
''' if data is scalar, an index must be provided to repeat the value of scalar matching the index'''
pd.Series(5, index = ['a','b','c','d','e'])

a    5
b    5
c    5
d    5
e    5
dtype: int64

In [19]:
pd.Series(5., index = ['a','b','c','d','e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

10.4 Series is ndarray-like

In [20]:
#acts similar to ndarray
#valid argument for most numpy functions. However, things like slicing also slice the index.

In [21]:
#accseeing a single value of series like ndarray
s[0]

-0.04213986224838869

In [22]:
#accessing vaues of a range
s[:5]

0   -0.042140
1    0.009500
2    0.599536
3    1.025823
4    0.698095
dtype: float64

In [23]:
''' Following example will return a range of values in series whose value is greater than the median of series'''
s[s > s.median()]

3    1.025823
4    0.698095
dtype: float64

In [24]:
''' this line of code will return values on specific indexes'''
s[[4,3,1]]

4    0.698095
3    1.025823
1    0.009500
dtype: float64

In [26]:
np.exp(s) #e is exponent and s is the values 0.958736 1.009545 1.821273 ..

0    0.958736
1    1.009545
2    1.821273
3    2.789390
4    2.009920
dtype: float64

In [27]:
s[0]

-0.04213986224838869

In [28]:
s[0] = 12

In [29]:
s[0]

12.0

In [30]:
s

0    12.000000
1     0.009500
2     0.599536
3     1.025823
4     0.698095
dtype: float64

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
s = pd.Series(np.random.randn(5), index = ['a','b','c','d','e'])

In [5]:
s

a   -0.392872
b    0.340645
c    0.616639
d   -0.060876
e    0.459857
dtype: float64

In [6]:
s[0]

C:\Users\Dell\AppData\Local\Temp\ipykernel_3232\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

-0.39287170767926877

In [7]:
s[:5]

a   -0.392872
b    0.340645
c    0.616639
d   -0.060876
e    0.459857
dtype: float64

In [8]:
s[s > s.median()]

c    0.616639
e    0.459857
dtype: float64

In [9]:
s[[4,3,1]]

C:\Users\Dell\AppData\Local\Temp\ipykernel_3232\3287144557.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[4,3,1]]

e    0.459857
d   -0.060876
b    0.340645
dtype: float64

In [10]:
np.exp(s)

a    0.675115
b    1.405854
c    1.852691
d    0.940940
e    1.583847
dtype: float64

In [11]:
s['a']

-0.39287170767926877

In [12]:
s['e'] = 12

In [13]:
s

a    -0.392872
b     0.340645
c     0.616639
d    -0.060876
e    12.000000
dtype: float64

In [14]:
'e' in s

True

In [17]:
s['f'] # f is not present

KeyError: 'f'

In [19]:
# using get method to recieve none instead of error or any default value
s.get('f')

In [20]:
s.get('f',np.nan)

nan

In [26]:
s.get('f',np.nan)

nan

10.6 Vectorized operations and label alignment Series

In [28]:
s + s # it will add the data of respective index value of s with s. like s['a'] will be added with s['a']

a    -0.785743
b     0.681290
c     1.233279
d    -0.121751
e    24.000000
dtype: float64

In [29]:
s * 2 # it will multiply all the values with 2

a    -0.785743
b     0.681290
c     1.233279
d    -0.121751
e    24.000000
dtype: float64

In [35]:
s = pd.Series(np.random.rand(10), name = 'something') # something label assigned to the series
s

0    0.494088
1    0.266861
2    0.971410
3    0.808923
4    0.111722
5    0.819835
6    0.738742
7    0.410077
8    0.202910
9    0.506368
Name: something, dtype: float64

In [37]:
s.name # name of series

'something'

In [41]:
s2 = s.rename('different') # copied the content of s into s2 and changed the name of the series
s2.name

'different'

In [42]:
s.name

'something'

In [43]:
s2

0    0.494088
1    0.266861
2    0.971410
3    0.808923
4    0.111722
5    0.819835
6    0.738742
7    0.410077
8    0.202910
9    0.506368
Name: different, dtype: float64

11. Data Frames

11.1 From dict of Series or dicts to DataFrames

In [46]:
''' creating a dictionary'''
d = {
    'one' : pd.Series([1.,2.,3.], index = ['a','b','c']),
     'two' : pd.Series([1.,2.,3.,4.], index = ['a','b','c','d'])
                       }
''' creating dataframes'''
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [48]:
''' datd frame is like a table'''
pd.DataFrame(d, index=['d','b','a']) #row labels

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [49]:
pd.DataFrame(d, index =['d','b','a'], columns = ['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [51]:
pd.DataFrame(d, index =['d','b','a'], columns = ['2', 'three']) # no values for these columns

     2 three
d  NaN   NaN
b  NaN   NaN
a  NaN   NaN

In [52]:
df.columns

Index(['one', 'two'], dtype='object')

11.2 From dict of ndarrays / lists to DataFrames

In [53]:
d = {
    'one' : [1.,2.,3.,4.],
    'two' : [4.,3.,2.,1.]
}
df1 = pd.DataFrame(d)

In [54]:
df1

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [60]:
d = {
    'one' : [1.,2.,3.,4.],
    'two' : [4.,3.,2.,1.] 
}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [61]:
pd.DataFrame(d, index = ['a','b','c','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

11.3 From a list of dicts

In [2]:
 ''' creating a Data Frame from list of dictionaries'''
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
data2 = [{'a':1, 'b' : 2}, {'a':5,'b' : 10, 'c' : 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [3]:
''' passing list of dictionaries as data and indexes(row labesl)'''
pd.DataFrame(data2, index = ['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [4]:
''' passing list of dictionaries and columns (columns label)'''
pd.DataFrame(data2, columns = ['a','b'])

   a   b
0  1   2
1  5  10

11.4 From a dictionary of tuples to Data Frame

In [6]:
# multi-indexed frame by passing a tuples dictionary
pd.DataFrame({('a','b'): {('A','B') :1, ('A','C'):2},
        ('a','a'): {('A','C') : 3, ('A', 'B') : 4},
        ('a','c') : {('A','B') : 5, ('A','C') : 6},
        ('b','a') : {('A','C') : 7, ('A','B') : 8},
        ('b','b') : {('A','D') : 9, ('A', 'B') : 10}})
#pd.DataFrame(data)

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

11.5 Alternate Constructors

In [5]:
''' DataFrame.from_dict --> convert dictionary or a dict of array-like sequences into DataFrame. orient parameter is column by default.
but can be set to 'index'.
DataFrame.from_records --> takes a list of tuples or an ndarray with structured dtype. index may be a specified field of the structure 
dtypes'''
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
data = np.zeros((2,), dtype = [('A', 'i4'), ('B', 'f4'),('C', 'a10')])
data
# In the below result the first 0 is integer (i4) as mentioned in given dtype, 0. is float (f4) and b'' is byte string(a10 or S10)

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [6]:
pd.DataFrame.from_records(data, index = 'C')

     A    B
C
b''  0  0.0
b''  0  0.0

In [7]:
'''DataFrame.from_items --> takes a sequence of (key, value) pairs, where the keys are columns(or rows, if orient = index) and values
are column values (row values)
This is useful for DataFrame construction where columns are in a particular order'''
pd.DataFrame.from_items([('A', [1,2,3]), ('B', [4,5,6])])

AttributeError: type object 'DataFrame' has no attribute 'from_items'

In [35]:
pd.DataFrame(dict([('A', [1,2,3]), ('B', [4,5,6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [36]:
pd.DataFrame(dict([('A',[1,2,3]),('B', [4,5,6])], orient = 'index', columns = ['one', 'two', 'three']))

   A  B orient columns
0  1  4  index     one
1  2  5  index     two
2  3  6  index   three

In [37]:
pd.DataFrame.from_dict(dict([('A',[1,2,3]),('B', [4,5,6])], orient = 'index', columns = ['one', 'two', 'three']))

   A  B orient columns
0  1  4  index     one
1  2  5  index     two
2  3  6  index   three

In [38]:
items = [('A', [1, 2, 3]), ('B', [4, 5, 6])]

df = pd.DataFrame.from_dict(dict(items), orient='index', columns=['one', 'two', 'three'])
print(df)

   one  two  three
A    1    2      3
B    4    5      6

11.6 Column selection, addition, deletion

In [39]:
#DataFrame can be treated semantically like a dict of like-indexed series objects. 
df['one']

A    1
B    4
Name: one, dtype: int64

In [40]:
df['three'] = df['one'] * df['two'] #after calculation assigning value to column named three

In [41]:
df['three']

A     2
B    20
Name: three, dtype: int64

In [42]:
df['flag'] = df['one'] > 2 # if value of column one is > 2 assign True otherwise False

In [43]:
df # print complete dataframe

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

In [44]:
del df['two'] # delete a column named two from data frame

In [45]:
df

   one  three   flag
A    1      2  False
B    4     20   True

In [46]:
three = df.pop('three') # pop a complete column three from dataframe

In [47]:
df

   one   flag
A    1  False
B    4   True

In [48]:
df['foo'] = 'bar' # a column 'foo' will be populated with 'bar'

In [49]:
df

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [50]:
# inserting a series that does not have a same index as Data Frame.
df['one_trunc'] = df['one'][:2]

In [51]:
df

   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [53]:
# by default new columns are inserted at the end. To insert at your desired location use keyword 'insert'
""" First argument : index where new column will be inserted
Second argument : label or title of a new column
Third argument : value of the column"""
df.insert(1, 'bar2', df['one'])

In [54]:
df

   one  bar2   flag  foo  one_trunc
A    1     1  False  bar          1
B    4     4   True  bar          4

11.7 Indexing / Selection

In [55]:
# row selection, return a series whose index is the columns of the Data Frame

In [58]:
df.loc['B'] # returns the column labels and values on row label 'B'

one             4
bar2            4
flag         True
foo           bar
one_trunc       4
Name: B, dtype: object

In [64]:
df.iloc[1] # returns all values of 2nd row

one             4
bar2            4
flag         True
foo           bar
one_trunc       4
Name: B, dtype: object

In [66]:
df.iloc[0] # returns all values of first row

one              1
bar2             1
flag         False
foo            bar
one_trunc        1
Name: A, dtype: object

11.8 Data alignment and arithmetic

In [67]:
# aligns the data on basis of row and column labesl
df = pd.DataFrame(np.random.randn(10,4), columns = ['A','B','C','D'])

In [68]:
df2 = pd.DataFrame(np.random.rand(7,3), columns = ['A','B','C'])

In [69]:
# randn --> random numbers from standard normal distribution
#standard normal distribution --> mean --> 0 , SD --> 1
# 7 --> rows, 3 --> columns
df + df2 # add values of respective column labels

          A         B         C   D
0  0.955729  0.699067 -1.150764 NaN
1  0.712845 -0.816574 -0.192502 NaN
2  1.473106  0.516385  1.090695 NaN
3 -1.465592  0.214965  0.878784 NaN
4  0.961960  0.494669  0.816321 NaN
5  0.086340  0.068770  1.271714 NaN
6  0.912070 -0.049446 -0.197215 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [70]:
# in above output D is NAN because column D is only in df and no matching column in df2 that's why output is NAN

In [72]:
#when doing operation between data frame (table) and Series(a row or column) the default behavior is to align series index on the Data
#frame columns
df - df.iloc[0] # row wise subtraction. it will delete the values of first row with all the other rows including the first one.
# in this example 'D" has value becaue df has 'D' value and here we are dealing with df not with df2

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.882549 -1.514639  1.562750 -0.642108
2  0.630888 -0.245475  3.184513 -1.249801
3 -2.754570 -0.113257  2.347835 -0.598825
4 -0.080204  0.287449  2.332408 -2.598242
5 -1.166031 -0.092800  3.327969 -1.040962
6 -0.505710 -0.209758  1.679827  0.520646
7 -0.809519 -1.701299  3.241000 -0.665039
8 -0.391400  3.045284  3.231120 -0.269248
9 -0.767950  3.687979  1.882847 -0.084280

In [73]:
df*5+2

          A          B         C         D
0  5.261452   1.102177 -8.558844  5.286999
1  0.848708  -6.471016 -0.745093  2.076457
2  8.415892  -0.125197  7.363720 -0.962005
3 -8.511398   0.535893  3.180332  2.292872
4  4.860430   2.539423  3.103196 -7.704210
5 -0.568702   0.638175  8.081004  0.082188
6  2.732900   0.053386 -0.159709  7.890228
7  1.213857  -7.404317  7.646158  1.961805
8  3.304449  16.328599  7.596759  3.940760
9  1.421701  19.542073  0.855393  4.865601

In [74]:
1/df

          A         B         C           D
0  1.533060 -5.569029 -0.473537    1.521144
1 -4.342946 -0.590248 -1.821432   65.396367
2  0.779315 -2.352723  0.932189   -1.688046
3 -0.475674 -3.415051  4.236095   17.072310
4  1.747989  9.269170  4.532287   -0.515240
5 -1.946509 -3.671545  0.822233   -2.607138
6  6.822215 -2.568563 -2.315127    0.848864
7 -6.360165 -0.531671  0.885558 -130.907826
8  3.833035  0.348952  0.893374    2.576310
9 -8.646045  0.285029 -4.368310    1.744835

In [75]:
df**4

           A           B          C             D
0   0.181036    0.001040  19.887741  1.867748e-01
1   0.002811    8.238764   0.090855  5.467459e-08
2   2.711116    0.032637   1.324294  1.231582e-01
3  19.532685    0.007352   0.003106  1.177147e-05
4   0.107114    0.000135   0.002370  1.418929e+01
5   0.069659    0.005503   2.187867  2.164433e-02
6   0.000462    0.022974   0.034810  1.925965e+00
7   0.000611   12.514947   1.626043  3.405160e-09
8   0.004633   67.442683   1.569879  2.269905e-02
9   0.000179  151.510813   0.002746  1.078903e-01

In [76]:
df1 = pd.DataFrame({'a' : [1,0,1], 'b' : [0,1,1]}, dtype=bool)

In [77]:
df1

       a      b
0   True  False
1  False   True
2   True   True

In [79]:
df2 = pd.DataFrame({'a' : [0,1,1], 'b' : [1,1,0]}, dtype = bool)

In [80]:
df2

       a      b
0  False   True
1   True   True
2   True  False

In [81]:
pd.DataFrame({'a' : [0,1,1], 'b' : [1,1,0]}, dtype = bool)

       a      b
0  False   True
1   True   True
2   True  False

In [82]:
df1 & df2 # and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [83]:
df1 | df2 # or logical operator

      a     b
0  True  True
1  True  True
2  True  True

In [85]:
-df1 #not logical operation

       a      b
0  False   True
1   True  False
2  False  False

11.9 Transposing

In [86]:
#Transpose --> rows into columns and columns into rows. It happens with a T attribute
df[:5].T # first 5 rows

          0         1         2         3         4
A  0.652290 -0.230258  1.283178 -2.102280  0.572086
B -0.179565 -1.694203 -0.425039 -0.292821  0.107885
C -2.111769 -0.549019  1.072744  0.236066  0.220639
D  0.657400  0.015291 -0.592401  0.058574 -1.940842

In [87]:
# creating a DataFrame by passing a numpy array. with a datetime index and labeled columns

In [96]:
dates = pd.date_range('20130101', periods =6)

In [97]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [98]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [99]:
df

                   A         B         C         D
2013-01-01 -0.341943 -0.795254  0.709884  0.467978
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634
2013-01-03  0.073300 -2.165910  0.422508 -0.496780
2013-01-04  0.492924  0.940839 -0.548521  0.269701
2013-01-05  0.132964  0.362980 -0.755013 -1.184452
2013-01-06 -0.991777  1.400068 -0.129698 -1.750675

In [100]:
# creating a DataFrame by passing a dict objects that can be converted to series like.

In [101]:
df2 = pd.DataFrame({'A' :1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4, dtype ='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'})

In [102]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [103]:
#dtypes of above table
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

12. Viewing Data

In [104]:
#we can dispaly or view data in different ways:
#see the top and bottom rows of the frame
#selecting a single column
#selecting via[], which slices the rows
#for getting a cross section using a label
#using isin(0 method for filtering and many more

In [105]:
df.head()

                   A         B         C         D
2013-01-01 -0.341943 -0.795254  0.709884  0.467978
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634
2013-01-03  0.073300 -2.165910  0.422508 -0.496780
2013-01-04  0.492924  0.940839 -0.548521  0.269701
2013-01-05  0.132964  0.362980 -0.755013 -1.184452

In [106]:
df.tail(3) #last 3 records

                   A         B         C         D
2013-01-04  0.492924  0.940839 -0.548521  0.269701
2013-01-05  0.132964  0.362980 -0.755013 -1.184452
2013-01-06 -0.991777  1.400068 -0.129698 -1.750675

In [107]:
df.index # display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [108]:
df.columns #display columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [109]:
df.values #print values of columns

array([[-0.34194348, -0.79525423,  0.70988374,  0.46797763],
       [ 1.50763533, -0.14157676, -0.75160678, -1.15363365],
       [ 0.07330039, -2.16590986,  0.42250809, -0.49677964],
       [ 0.49292428,  0.94083887, -0.54852058,  0.26970069],
       [ 0.13296447,  0.36297996, -0.75501263, -1.1844516 ],
       [-0.99177714,  1.40006825, -0.12969761, -1.75067516]])

In [110]:
df. T # transpose of data

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.341943    1.507635    0.073300    0.492924    0.132964   -0.991777
B   -0.795254   -0.141577   -2.165910    0.940839    0.362980    1.400068
C    0.709884   -0.751607    0.422508   -0.548521   -0.755013   -0.129698
D    0.467978   -1.153634   -0.496780    0.269701   -1.184452   -1.750675

In [111]:
df.sort_index(axis=1, ascending = False) # axis = 0 --> sort rows by index(default)
#axis = 1 --> sort columns by colmns name
#ascending = True/False --> sort ascending of desecnding

                   D         C         B         A
2013-01-01  0.467978  0.709884 -0.795254 -0.341943
2013-01-02 -1.153634 -0.751607 -0.141577  1.507635
2013-01-03 -0.496780  0.422508 -2.165910  0.073300
2013-01-04  0.269701 -0.548521  0.940839  0.492924
2013-01-05 -1.184452 -0.755013  0.362980  0.132964
2013-01-06 -1.750675 -0.129698  1.400068 -0.991777

In [113]:
df.sort_values(by='B') # sorting by values, by default ascending is True

                   A         B         C         D
2013-01-03  0.073300 -2.165910  0.422508 -0.496780
2013-01-01 -0.341943 -0.795254  0.709884  0.467978
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634
2013-01-05  0.132964  0.362980 -0.755013 -1.184452
2013-01-04  0.492924  0.940839 -0.548521  0.269701
2013-01-06 -0.991777  1.400068 -0.129698 -1.750675

In [114]:
df.describe() # a quick statistic summary of your data

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.145517 -0.066476 -0.175408 -0.641310
std    0.838151  1.287963  0.624579  0.879718
min   -0.991777 -2.165910 -0.755013 -1.750675
25%   -0.238133 -0.631835 -0.700835 -1.176747
50%    0.103132  0.110702 -0.339109 -0.825207
75%    0.402934  0.796374  0.284457  0.078081
max    1.507635  1.400068  0.709884  0.467978

In [116]:
df['A'] # selecting a single columns. which yields a series, equivalent to df.A

2013-01-01   -0.341943
2013-01-02    1.507635
2013-01-03    0.073300
2013-01-04    0.492924
2013-01-05    0.132964
2013-01-06   -0.991777
Freq: D, Name: A, dtype: float64

In [117]:
df.A

2013-01-01   -0.341943
2013-01-02    1.507635
2013-01-03    0.073300
2013-01-04    0.492924
2013-01-05    0.132964
2013-01-06   -0.991777
Freq: D, Name: A, dtype: float64

In [118]:
#slicing
df[0:3]

                   A         B         C         D
2013-01-01 -0.341943 -0.795254  0.709884  0.467978
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634
2013-01-03  0.073300 -2.165910  0.422508 -0.496780

In [121]:
df['20130102':'20130104'] # using index

                   A         B         C         D
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634
2013-01-03  0.073300 -2.165910  0.422508 -0.496780
2013-01-04  0.492924  0.940839 -0.548521  0.269701

In [122]:
df.loc[:,['A','B']] # .loc --> label based indexing
#df.loc[row_indexr,column_indexer] row_indexer--> which row to select, column_indexer --> which column to select
# for our case : --> select all rows, ['A','B'] --> only two columns A and B

                   A         B
2013-01-01 -0.341943 -0.795254
2013-01-02  1.507635 -0.141577
2013-01-03  0.073300 -2.165910
2013-01-04  0.492924  0.940839
2013-01-05  0.132964  0.362980
2013-01-06 -0.991777  1.400068

In [125]:
df.loc['20130102' : '20130104', ['A','B']] # sliced rows and columns

                   A         B
2013-01-02  1.507635 -0.141577
2013-01-03  0.073300 -2.165910
2013-01-04  0.492924  0.940839

In [127]:
df.loc['20130102',['A','B']] # reduction in the dimensions of returned values

A    1.507635
B   -0.141577
Name: 2013-01-02 00:00:00, dtype: float64

In [128]:
#for grtting a scalar value
df.loc[dates[0],'A']

-0.3419434796343664

In [130]:
#for getting fast access to a scalar
df.at[dates[0],'A'] # .at when you only need one value

-0.3419434796343664

In [132]:
df.iloc[3] # 4th row of df

A    0.492924
B    0.940839
C   -0.548521
D    0.269701
Name: 2013-01-04 00:00:00, dtype: float64

In [134]:
df.iloc[3:5,0:2] #df.iloc[row_indexer,column_indexer] , row_indexer --> selected rows. column_indexer --> selected columns

                   A         B
2013-01-04  0.492924  0.940839
2013-01-05  0.132964  0.362980

In [136]:
df.iloc[[1,2,4],[0,2]] #selection by list of integer position locations

                   A         C
2013-01-02  1.507635 -0.751607
2013-01-03  0.073300  0.422508
2013-01-05  0.132964 -0.755013

In [137]:
# slicing 
df.iloc[:,1:3] # all rows 1 and 2 columns

                   B         C
2013-01-01 -0.795254  0.709884
2013-01-02 -0.141577 -0.751607
2013-01-03 -2.165910  0.422508
2013-01-04  0.940839 -0.548521
2013-01-05  0.362980 -0.755013
2013-01-06  1.400068 -0.129698

In [138]:
#getting a value explicitly
df.iloc[1,1]

-0.14157676363520436

In [142]:
df[df.A >0] #boolean indexing #using a single column value to select data

                   A         B         C         D
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634
2013-01-03  0.073300 -2.165910  0.422508 -0.496780
2013-01-04  0.492924  0.940839 -0.548521  0.269701
2013-01-05  0.132964  0.362980 -0.755013 -1.184452

In [143]:
df[df >0] # boolean indexing, if condition false value will change to NAN

                   A         B         C         D
2013-01-01       NaN       NaN  0.709884  0.467978
2013-01-02  1.507635       NaN       NaN       NaN
2013-01-03  0.073300       NaN  0.422508       NaN
2013-01-04  0.492924  0.940839       NaN  0.269701
2013-01-05  0.132964  0.362980       NaN       NaN
2013-01-06       NaN  1.400068       NaN       NaN

In [146]:
df2 = df.copy() #copying the df into df2

In [147]:
df2

                   A         B         C         D
2013-01-01 -0.341943 -0.795254  0.709884  0.467978
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634
2013-01-03  0.073300 -2.165910  0.422508 -0.496780
2013-01-04  0.492924  0.940839 -0.548521  0.269701
2013-01-05  0.132964  0.362980 -0.755013 -1.184452
2013-01-06 -0.991777  1.400068 -0.129698 -1.750675

In [149]:
df2['E'] = ['one','one','two','three','four','three']

In [150]:
df2

                   A         B         C         D      E
2013-01-01 -0.341943 -0.795254  0.709884  0.467978    one
2013-01-02  1.507635 -0.141577 -0.751607 -1.153634    one
2013-01-03  0.073300 -2.165910  0.422508 -0.496780    two
2013-01-04  0.492924  0.940839 -0.548521  0.269701  three
2013-01-05  0.132964  0.362980 -0.755013 -1.184452   four
2013-01-06 -0.991777  1.400068 -0.129698 -1.750675  three

In [151]:
df2[df2['E'].isin(['two','four'])] # isin to filter values

                   A        B         C         D     E
2013-01-03  0.073300 -2.16591  0.422508 -0.496780   two
2013-01-05  0.132964  0.36298 -0.755013 -1.184452  four

In [152]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [153]:
#COmplete